cfg/DataProcessors/ФормированиеСпискаРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеСпискаРаботников</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяРегистра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСвойстваИКатегории</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУволенных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьУволенных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнятьЗапрос</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбиратьСотрудника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьРаботающихПоДоговорамГПХ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cfg/InformationRegisters/РегламентированныйПроизводственныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РегламентированныйПроизводственныйКалендарь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пятидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шестидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/Enums/ВидыВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтработанноеВПределахНормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтработанноеСверхНормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦелодневноеНеотработанное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧасовоеНеотработанное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноОплачиваемоеВПределахНормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧасовоеОтработанноеВПределахНормы</Name>
					<Comment>Начисление за работу неполную смену в пределах нормы времени</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Enums/ВидыДнейПроизводственногоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДнейПроизводственногоКалендаря</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
					<Comment>(Общ) Рабочий день</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Enums/СпособыРасчетаОплатыТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СпособыРасчетаОплатыТруда</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АлиментыПроцентом</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлиментыПроцентомДоПредела</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлиментыФиксСуммой</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлиментыФиксСуммойДоПредела</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Взносы</Name>
					<Comment>Взносы, которые перечисляются работниками</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносыФОТ</Name>
					<Comment>Взносы, которые перечисляет организация на ФОТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыслугаЛет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосударственноеПособие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаДоСреднегоЗаработка</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаВечерниеЧасы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаНочныеЧасы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Замена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндексацияЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндексацияСоциальныхНачислений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнителныйЛистСУчетомОграничения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныйЛистПроцентом</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныйЛистПроцентомДоПредела</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныйЛистФиксСуммой</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныйЛистФиксСуммойДоПредела</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияНевыплаченнойЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НулеваяСумма</Name>
					<Comment>(Общ) ВР без расчета результата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДневнойТарифнойСтавке</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоМесячнойТарифнойСтавкеПоДням</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоМесячнойТарифнойСтавкеПоЧасам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСреднемуЗаработку</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСреднемуЗаработкуДляОтпуска</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСреднемуЗаработкуФСС</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЧасовойТарифнойСтавке</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЧасовойТарифнойСтавкеУмножитьНаПроцент</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтовыйСбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдельныйЗаработок</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнойСуммой</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыходноеПособие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСреднемуЗаработкуКомпенсацияОтпуска</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСреднемуЗаработкуВозвратОтпуска</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруФиксированнойСуммой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПособиеПоУходуЗаРебенкомДо3Лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПособиеПриРождении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДоплатаЗаПраздничные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1ДП2ОП3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1ДП2УП3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1ОП2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1ОП2ДП3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1ОП2УП3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1УП2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1УП2ДП3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1УП2ОП3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1УП2УП3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП3ДП1ОП2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМаксП1_П2УП3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМаксП1_П2УП3ОП4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМаксП1_П2УП3УП4ДП5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМаксП1ВП2_0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМаксП1УП2_П3УП4ДП5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМаксП1УП2_П5ДП3УП4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМаксП1УП2ДП3ВП4_0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМинП1_П2УП3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМинП1_П2УП3ОП4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1УП2УП3ДП4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяФормула</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоначислениеОтОбратного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндексацияАлиментов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаДоМЗП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Enums/СпособыРегистрацииВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СпособыРегистрацииВремени</Name>
			<Comment>(Общ) Предназначено для указания способа регистрации времени разовых начислений и невыходов (целосменный или часовой)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РегистрацияДляЦелойСмены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияДляЧастиСмены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Enums/СпособыВыплатыЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СпособыВыплатыЗарплаты</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЧерезКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезБанк</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/DataProcessors/ФормированиеСпискаРаботников/Forms/ФормаНастройки/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мСтруктураНедоступныхОтборов Экспорт; 

Перем мСписокДоступныхСпособовРасчета;// Список недоступных для начисления способов расчета
Перем мСоответствиеДоходовИВычетов;
Перем мСписокКодовВычетов;

Перем мОбработкаТайпинга;
Перем мТекстТайпинга;
Перем мПоследнееЗначениеЭлементаТайпинга;

// Диалог настройки периода
Перем мНастройкаПериода;

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура УказатьВладельцаПолюПодразделения(Элемент)

	Если ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		Элемент.ВыборПоВладельцу = ПостроительОтчета.Отбор.ОбособленноеПодразделение.Значение
	КонецЕсли;

КонецПроцедуры

// Функция формирует структуру параметров для для ввода головной организации по подстроке
//  и для ввода типа отнесения расходов к ЕНВД
//
// Параметры
//  НЕТ
//
// Возвращаемое значение:
//   Структура имен и значений параметров
//
Функция ПолучитьСтруктуруПараметровТайпинга(ИмяЭУ = "")
	
	Если ИмяЭУ = "КодВычета" Тогда
		СтруктураПараметров = Новый Структура("Ссылка", мСписокКодовВычетов);
	ИначеЕсли ИмяЭУ = "ОсновныеНачисления" Тогда
		МассивВидовВремени = Новый СписокЗначений;
	    Если ЭлементыФормы.ПанельСтраницы.Страницы[0].Имя = "РазовыеРасчеты" Тогда
			МассивВидовВремени.Добавить(Перечисления.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы);
			МассивВидовВремени.Добавить(Перечисления.ВидыВремени.ОтработанноеВПределахНормы);
			МассивВидовВремени.Добавить(Перечисления.ВидыВремени.ОтработанноеСверхНормы);
			МассивВидовВремени.Добавить(Перечисления.ВидыВремени.ЦелодневноеНеотработанное);
		Иначе
			МассивВидовВремени.Добавить(Перечисления.ВидыВремени.ЧасовоеНеотработанное);
			МассивВидовВремени.Добавить(Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы);
		КонецЕсли;
		СтруктураПараметров = Новый Структура("ВидВремени, СпособРасчета", МассивВидовВремени, мСписокДоступныхСпособовРасчета);
	Иначе
		СтруктураПараметров = Новый Структура();
	КонецЕсли;

	Возврат СтруктураПараметров;

КонецФункции // ПолучитьСтруктуруПараметровТайпинга()()

Процедура ОбновитьСписокПраздничныхДнейМесяца()

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Праздник",Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник);
	Запрос.УстановитьПараметр("ДатаНачала",НачалоМесяца(ДатаАктуальности));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецМесяца(ДатаАктуальности));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ВидДня = &Праздник
	|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	СписокПраздников = Новый СписокЗначений; 			   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокПраздников.Добавить(Выборка.ДатаКалендаря, Формат(Выборка.ДатаКалендаря, "ДФ='d ММММ'"));
	КонецЦикла;    
	ЭлементыФормы.ДатаПраздника.СписокВыбора = СписокПраздников;
	ЭлементыФормы.ДатаПраздника.ВысотаСпискаВыбора = СписокПраздников.Количество();

КонецПроцедуры

// Процедура выполняет отбор при начале выбора статьи затрат 
//  используется в документе "Ввод процента деятельности ЕНВД" и в обработке "Формирование списка работников"
//
// Параметры:
//  Элемент - обрабатываемый элемент формы
//  ОтношениеСтатьиЗатратКЕНВД - значение перечисления ОтнесениеРасходовКДеятельностиЕНВД
//    определяет отношение к ЕНВД данного элемента формы
//
//
Процедура УстановитьОтборПриНачалеВыбора(Элемент, ОтношениеСтатьиЗатратКЕНВД)
	
	ФормаВыбора          = Справочники.СтатьиЗатрат.ПолучитьФормуВыбора(,Элемент,"дляФормыОтбораРаботников");
	
	ФормаВыбора.СправочникСписок.Отбор.ОтнесениеРасходовКДеятельностиЕНВД.Значение      = ОтношениеСтатьиЗатратКЕНВД;
	ФормаВыбора.СправочникСписок.Отбор.ОтнесениеРасходовКДеятельностиЕНВД.Использование = Истина;
	ФормаВыбора.СправочникСписок.Отбор.ОтнесениеРасходовКДеятельностиЕНВД.ВидСравнения  = ВидСравнения.Равно;
	
	ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ОтнесениеРасходовКДеятельностиЕНВД.Доступность = Ложь;

	ФормаВыбора.Открыть();

КонецПроцедуры

Функция СформироватьСписокПричинНевыхода(СпособРегистрацииВремени)

	СписокПричинНевыхода = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НулеваяСумма", Перечисления.СпособыРасчетаОплатыТруда.НулеваяСумма);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновныеНачисления.Ссылка КАК ВидРасчета
	|ИЗ
	|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисления
	|ГДЕ
	|	(НЕ ОсновныеНачисления.Предопределенный)
	|	И ОсновныеНачисления.СпособРасчета В(&НулеваяСумма)
	|	И ОсновныеНачисления.ВидВремени = &ВидВремени";
	
	Если СпособРегистрацииВремени = Перечисления.СпособыРегистрацииВремени.РегистрацияДляЦелойСмены Тогда
		
		Запрос.УстановитьПараметр("ВидВремени", Перечисления.ВидыВремени.ЦелодневноеНеотработанное);
		СписокПричинНевыхода.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидРасчета"));
		СписокПричинНевыхода.Вставить(0,ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет);
		СписокПричинНевыхода.Вставить(1,ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчетПоСоглашению);
		СписокПричинНевыхода.Вставить(2,ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.НевыходРегл);
		СписокПричинНевыхода.Вставить(3,ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.Прогул);
		СписокПричинНевыхода.Вставить(4,ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыУчебный);
		
	Иначе // здесь только почасовые невыходы
		
		Запрос.УстановитьПараметр("ВидВремени", Перечисления.ВидыВремени.ЧасовоеНеотработанное);
		СписокПричинНевыхода.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидРасчета"));
		
	КонецЕсли;
	
	Возврат СписокПричинНевыхода
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	Если ЭлементыФормы.ПанельСтраницы.Свертка <> РежимСверткиЭлементаУправления.Нет Тогда
		Возврат
	КонецЕсли;
	
	СтраницаДокумента = ЭлементыФормы.ПанельСтраницы.Страницы[0];
	
	// Установить настройку периода по умолчанию
	мНастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
	
	ДатаНачала		= ДатаАктуальности;
	ДатаОкончания	= КонецМесяца(ДатаАктуальности);
	
	Если СтраницаДокумента.Имя = "НевыходыВОрганизацияхДляЦелойСмены" Тогда
		ЭлементыФормы.ВидРасчетаЦелосменныйНевыход.СписокВыбора = СформироватьСписокПричинНевыхода(Перечисления.СпособыРегистрацииВремени.РегистрацияДляЦелойСмены);
	ИначеЕсли СтраницаДокумента.Имя = "ЗаявлениеНаПрименениеЛьготы" Тогда
		ПостроительОтчета.Отбор.Добавить("ЛьготаНДФЛ","ЛьготаНДФЛ",);
		ДатаИзменения = ДатаАктуальности;
		
	ИначеЕсли СтраницаДокумента.Имя = "Выплаты" Тогда
		ПереключательХарактерВыплаты = 2;
		
	ИначеЕсли СтраницаДокумента.Имя = "НевыходыВОрганизацияхДляЧастиСмены" Тогда
		ЭлементыФормы.ВидРасчетаВнутрисменныйНевыход.СписокВыбора = СформироватьСписокПричинНевыхода(Перечисления.СпособыРегистрацииВремени.РегистрацияДляЧастиСмены);
	ИначеЕсли (СтраницаДокумента.Имя = "РазовыеРасчеты" Или СтраницаДокумента.Имя = "РазовыеРасчетыДляЧастиСмены") и ТипЗнч(ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций") Тогда
		
		СписокНеДоступныхСпособовРасчета = ПроведениеРасчетов.ПолучитьСписокНачисленийПоСреднемуЗаработку();
		СписокНеДоступныхСпособовРасчета.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ГосударственноеПособие);
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпособыРасчетаОплатыТруда.Ссылка
		|ИЗ
		|	Перечисление.СпособыРасчетаОплатыТруда КАК СпособыРасчетаОплатыТруда
		|ГДЕ
		|	(НЕ СпособыРасчетаОплатыТруда.Ссылка В (&Ссылка))";
		Запрос.УстановитьПараметр("Ссылка", СписокНеДоступныхСпособовРасчета);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			мСписокДоступныхСпособовРасчета.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
	ИначеЕсли СтраницаДокумента.Имя = "ОплатаПраздничныхИВыходныхДнейОрганизаций" Тогда
		
		ОбновитьСписокПраздничныхДнейМесяца();
		
		ЭлементыФормы.ПанельСтраницы.УстановитьПривязку(ГраницаЭлементаУправления.Верх,ЭлементыФормы.ОсновныеДействияФормы,ГраницаЭлементаУправления.Низ,ЭлементыФормы.ДатаАктуальности, ГраницаЭлементаУправления.Верх);
		ТекущаяВысотаФормы = ЭтаФорма.Высота;
		Если ТекущаяВысотаФормы < 400 Тогда
			ЭтаФорма.Высота = 400;
		КонецЕсли; 
		
	ИначеЕсли СтраницаДокумента.Имя = "ПереносЗадолженности" Тогда
		// Заполним реквизит формы МесяцСтрока
		МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(ПериодВозникновения);
		
	ИначеЕсли СтраницаДокумента.Имя = "ПоложенныеОтпуска" Тогда
		ТаблицаОтпусков = Реквизиты.ТаблицаОтпусков;
		
	ИначеЕсли СтраницаДокумента.Имя = "ПоложенныеОтпуска" Тогда

		
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Если Реквизиты <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Реквизиты,ЭтаФорма);
	КонецЕсли;
	ОповеститьОВыборе(ПолучитьСписокРаботников());
	
	Закрыть();

КонецПроцедуры

// Процедура устанавливает использование всех отборов
//
Процедура КоманднаяПанельОтборУстановитьФлажки(Кнопка)
	Для Каждого Отбор Из ПостроительОтчета.Отбор Цикл
		Если Найти(Отбор.ПутьКДанным,".") <> 0 Или Не мСтруктураНедоступныхОтборов.Свойство(Отбор.ПутьКДанным) Тогда
			Отбор.Использование = Истина
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура КоманднаяПанельОтборСнятьФлажки(Кнопка)
	Для Каждого Отбор Из ПостроительОтчета.Отбор Цикл
		Если Найти(Отбор.ПутьКДанным,".") <> 0 Или Не мСтруктураНедоступныхОтборов.Свойство(Отбор.ПутьКДанным) Тогда
			Отбор.Использование = Ложь
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки настройки периода.
//
Процедура ВыбПериодНажатие(Элемент)
	
	мНастройкаПериода.УстановитьПериод(ДатаНачала, КонецДня(ДатаОкончания));
	
	Если мНастройкаПериода.Редактировать() Тогда
		ДатаНачала		= мНастройкаПериода.ПолучитьДатуНачала();
		ДатаОкончания	= мНастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
	
КонецПроцедуры // ВыбПериодНажатие()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ДатаАктуальностиПриИзменении(Элемент)
	
	Если ЭлементыФормы.ПанельСтраницы.Свертка <> РежимСверткиЭлементаУправления.Нет Тогда
		Возврат
	КонецЕсли;
	
	СтраницаДокумента = ЭлементыФормы.ПанельСтраницы.Страницы[0];
	
	Если СтраницаДокумента.Имя = "ОплатаПраздничныхИВыходныхДнейОрганизаций" Тогда
		ОбновитьСписокПраздничныхДнейМесяца();
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВключатьУволенныхПриИзменении(Элемент)
	ЗаполнитьНачальныеНастройки(Ложь);
КонецПроцедуры

Процедура ТабличноеПолеОтборПередУдалением(Элемент, Отказ)
	ИмяОтбора = Элемент.ТекущиеДанные.ПутьКДанным;
	Отказ = ЗначениеЗаполнено(ИмяОтбора) И Найти(ИмяОтбора,".") = 0 И мСтруктураНедоступныхОтборов.Свойство(ИмяОтбора);
КонецПроцедуры

Процедура ТабличноеПолеОтборПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	ИмяОтбора = ДанныеСтроки.ПутьКДанным;
	Если ЗначениеЗаполнено(ИмяОтбора) И Найти(ИмяОтбора,".") = 0 И мСтруктураНедоступныхОтборов.Свойство(ИмяОтбора) Тогда
		ОформлениеСтроки.Ячейки.Использование.ТолькоПросмотр = Истина;
		ОформлениеСтроки.Ячейки.Имя.ТолькоПросмотр = Истина;
		ОформлениеСтроки.Ячейки.ВидСравнения.ТолькоПросмотр = Истина;
		ОформлениеСтроки.Ячейки.Значение.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ТабличноеПолеОтборИмяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = НЕ ЗначениеЗаполнено(ВыбранноеЗначение) Или Найти(ВыбранноеЗначение,".") <> 0 Или Не мСтруктураНедоступныхОтборов.Свойство(ВыбранноеЗначение);
	Если Не СтандартнаяОбработка Тогда
		Предупреждение(НСтр("ru='Отбор по ';uk='Відбір по '") + ?(ВыбранноеЗначение = "ОбособленноеПодразделение","организации","подразделению") + НСтр("ru=' уже установлен!';uk=' вже встановлено!'"));
	КонецЕсли;
КонецПроцедуры

Процедура ТабличноеПолеОтборЗначениеНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	// Отборы по свойствам и категориям должны быть обработаны специальным образом
	// Они определяются по представлению 
	Если Найти(НРег(ЭлементыФормы.ТабличноеПолеОтбор.ТекущаяСтрока.Представление), "категории") Тогда

		// Ограничение списка категорий
		Назначение = мСоответствиеНазначений.Получить(ЭлементыФормы.ТабличноеПолеОтбор.ТекущаяСтрока.Представление);

		УправлениеОтчетами.ОсуществитьВыборКатегории(Элемент, Назначение, ЭтаФорма, СтандартнаяОбработка);

	ИначеЕсли Найти(НРег(ЭлементыФормы.ТабличноеПолеОтбор.ТекущаяСтрока.Представление), "св-во") Тогда

		Свойство = мСоответствиеНазначений.Получить(ЭлементыФормы.ТабличноеПолеОтбор.ТекущаяСтрока.Представление);

		УправлениеОтчетами.ОсуществитьВыборСвойства(Элемент, Свойство, ЭтаФорма, СтандартнаяОбработка);

	ИначеЕсли ВыбиратьСотрудника И ИмяРегистра = "РаботникиОрганизаций" И ЭлементыФормы.ТабличноеПолеОтбор.ТекущаяСтрока.Имя = "Работник" И ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
		
		Если ЭлементыФормы.ТабличноеПолеОтбор.ТекущаяСтрока.ВидСравнения = ВидСравнения.ВИерархии ИЛИ 
		  ЭлементыФормы.ТабличноеПолеОтбор.ТекущаяСтрока.ВидСравнения = ВидСравнения.НеВИерархии Тогда
			СтандартнаяОбработка = Ложь;		
			ОрганизацияОтбор =  ПостроительОтчета.Отбор.ОбособленноеПодразделение.Значение;

			
			ФормаВыбора = Справочники.СотрудникиОрганизаций.ПолучитьФормуВыбора(,Элемент, ЭтотОбъект);
						
			ФормаВыбора.Отбор.Организация.Значение = ОрганизацияОтбор;
			ФормаВыбора.Отбор.Организация.Использование = ЗначениеЗаполнено(ОрганизацияОтбор);
			ФормаВыбора.Отбор.Организация.ВидСравнения = ВидСравнения.Равно;
			
			ФормаВыбора.ПараметрВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.ГруппыИЭлементы;
			ФормаВыбора.Открыть(); 	
		Иначе
			ПроцедурыУправленияПерсоналом.ОткрытьФормуВыбораСотрудникаОрганизации(Элемент, ЭтотОбъект, Истина, ДатаАктуальности, ПостроительОтчета.Отбор.ОбособленноеПодразделение.Значение, 1, СтандартнаяОбработка, Элемент.Значение);
		КонецЕсли;
		
	КонецЕсли;
	
	УказатьВладельцаПолюПодразделения(Элемент)
	
КонецПроцедуры

Процедура ТабличноеПолеОтборЗначениеАвтоПодборТекста(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка)
		
	Если ВыбиратьСотрудника И ИмяРегистра = "РаботникиОрганизаций" И ЭлементыФормы.ТабличноеПолеОтбор.ТекущаяСтрока.Имя = "Работник" Тогда
		ТекстАвтоПодбора = ПроцедурыУправленияПерсоналом.ПодобратьФИОРаботникаКандидата(СтандартнаяОбработка, "РаботникиОрганизации", Текст, ПостроительОтчета.Отбор.ОбособленноеПодразделение.Значение);
	КонецЕсли;
		
	УказатьВладельцаПолюПодразделения(Элемент)
	
КонецПроцедуры

Процедура ТабличноеПолеОтборЗначениеОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)
	
	Если ВыбиратьСотрудника И ИмяРегистра = "РаботникиОрганизаций" И ЭлементыФормы.ТабличноеПолеОтбор.ТекущаяСтрока.Имя = "Работник" Тогда
		Значение = ПроцедурыУправленияПерсоналом.ПодобратьСписокРаботниковКандидатов(СтандартнаяОбработка, "РаботникиОрганизации", Текст, Элемент.Значение, ПостроительОтчета.Отбор.ОбособленноеПодразделение.Значение);
	КонецЕсли;
	
	УказатьВладельцаПолюПодразделения(Элемент)
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// страницы документов

// Процедура - обработчик события "НачалоВыбора" поля ввода вида расчета
Процедура ОсновнойВидРасчетаНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	Если ТипЗнч(Элемент.Значение) = Тип("ПланВидовРасчетаСсылка.УдержанияОрганизаций") Тогда
		СтандартнаяОбработка = Ложь;
		СпВидовРасчета = Новый СписокЗначений;
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	УдержанияОрганизаций.Ссылка
		|ИЗ
		|	ПланВидовРасчета.УдержанияОрганизаций КАК УдержанияОрганизаций
		|ГДЕ
		|	УдержанияОрганизаций.Предопределенный = ИСТИНА
		|	И УдержанияОрганизаций.Ссылка <> ЗНАЧЕНИЕ(ПланВидовРасчета.УдержанияОрганизаций.УдержаниеПодотчетныхДС)");
		СпВидовРасчета.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));

		ФормаВыбораВидаРасчета = ПланыВидовРасчета.УдержанияОрганизаций.ПолучитьФормуВыбора("ФормаВыбора", Элемент);
	    ФормаВыбораВидаРасчета.НачальноеЗначениеВыбора = Элемент.Значение;
		
		ФормаВыбораВидаРасчета.Отбор.Ссылка.ВидСравнения = ВидСравнения.НеВСписке;
		ФормаВыбораВидаРасчета.Отбор.Ссылка.Значение = СпВидовРасчета;
		ФормаВыбораВидаРасчета.Отбор.Ссылка.Использование = Истина;

		ФормаВыбораВидаРасчета.Открыть();

		Возврат
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;

	//Предложим для выбора список расчетов, имеющих способ расчета, соответствующий указанной форме оплаты
	ФормаВыбораВидаРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПолучитьФормуВыбора("ФормаВыбора", Элемент, "дляФормыОтбораРаботников");
	
	ФормаВыбораВидаРасчета.НачальноеЗначениеВыбора = Элемент.Значение;
	
	МассивВидовВремени = Новый СписокЗначений;
    Если ЭлементыФормы.ПанельСтраницы.Страницы[0].Имя = "РазовыеРасчеты" Тогда
		МассивВидовВремени.Добавить(Перечисления.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы);
		МассивВидовВремени.Добавить(Перечисления.ВидыВремени.ОтработанноеВПределахНормы);
		МассивВидовВремени.Добавить(Перечисления.ВидыВремени.ОтработанноеСверхНормы);
		МассивВидовВремени.Добавить(Перечисления.ВидыВремени.ЦелодневноеНеотработанное);
	Иначе
		МассивВидовВремени.Добавить(Перечисления.ВидыВремени.ЧасовоеНеотработанное);
		МассивВидовВремени.Добавить(Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы);
	КонецЕсли;
	
	ФормаВыбораВидаРасчета.Отбор.ВидВремени.ВидСравнения = ВидСравнения.ВСписке;
	ФормаВыбораВидаРасчета.Отбор.ВидВремени.Значение = МассивВидовВремени;
	ФормаВыбораВидаРасчета.Отбор.ВидВремени.Использование = Истина;
	
	ФормаВыбораВидаРасчета.Отбор.СпособРасчета.ВидСравнения = ВидСравнения.ВСписке;
	ФормаВыбораВидаРасчета.Отбор.СпособРасчета.Значение = мСписокДоступныхСпособовРасчета;
	ФормаВыбораВидаРасчета.Отбор.СпособРасчета.Использование = Истина;

	ФормаВыбораВидаРасчета.Открыть();
	
КонецПроцедуры

// Процедура - обработчик события "ОкончаниеВводаТекста" поля ввода вида расчета
Процедура ОсновнойВидРасчетаОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)

	Если ТипЗнч(Элемент.Значение) = Тип("ПланВидовРасчетаСсылка.УдержанияОрганизаций") Тогда
		 Возврат
	КонецЕсли;
	
	ПроцедурыПоискаПоСтроке.ОкончаниеВводаТекстаВЭлементеУправления(Элемент, Текст, Значение, СтандартнаяОбработка, ПолучитьСтруктуруПараметровТайпинга("ОсновныеНачисления"), ЭтаФорма, Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций"), мОбработкаТайпинга, мТекстТайпинга, мПоследнееЗначениеЭлементаТайпинга, Ложь);
КонецПроцедуры

Процедура ОсновнойВидРасчетаАвтоПодборТекста(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка)
	Если ТипЗнч(Элемент.Значение) = Тип("ПланВидовРасчетаСсылка.УдержанияОрганизаций") Тогда
		 Возврат
	КонецЕсли;
	
	ПроцедурыПоискаПоСтроке.АвтоПодборТекстаВЭлементеУправления(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка, ПолучитьСтруктуруПараметровТайпинга("ОсновныеНачисления"), Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций"));
КонецПроцедуры

Процедура ВидРасчетаНевыходНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь
КонецПроцедуры



// Процедура - обработчик события "ПриИзменении" поля ввода периода регистрации.
//
Процедура ПериодВозникновенияПриИзменении(Элемент)
	
	РаботаСДиалогами.ДатаКакМесяцПодобратьДатуПоТексту(Элемент.Значение, ПериодВозникновения);
	Элемент.Значение = РаботаСДиалогами.ДатаКакМесяцПредставление(ПериодВозникновения);
	
КонецПроцедуры // ПериодВозникновенияПриИзменении()

// Процедура - обработчик события "Регулирование" поля ввода периода регистрации.
//
Процедура ПериодВозникновенияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ПериодВозникновения = ДобавитьМесяц(ПериодВозникновения, Направление);
	Элемент.Значение = РаботаСДиалогами.ДатаКакМесяцПредставление(ПериодВозникновения);
	
КонецПроцедуры // ПериодВозникновенияРегулирование()

// Процедура - обработчик события "Очистка" поля ввода периода регистрации.
//
Процедура ПериодВозникновенияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры // ПериодВозникновенияОчистка()

// Процедура - обработчик события "НачалоВыбораИзСписка" поля ввода периода регистрации.
//
Процедура ПериодВозникновенияНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	РаботаСДиалогами.НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, ПериодВозникновения, ЭтаФорма);
	
КонецПроцедуры // ПериодВозникновенияНачалоВыбораИзСписка()

// Процедура - обработчик события "АвтоПодборТекста" поля ввода периода регистрации.
//
Процедура ПериодВозникновенияАвтоПодборТекста(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка)
	
	РаботаСДиалогами.ДатаКакМесяцАвтоПодборТекста(Текст, ТекстАвтоПодбора, СтандартнаяОбработка);
	
КонецПроцедуры // ПериодВозникновенияАвтоПодборТекста()

// Процедура - обработчик события "ОкончаниеВводаТекста" поля ввода периода регистрации.
//
Процедура ПериодВозникновенияОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)
	
	РаботаСДиалогами.ДатаКакМесяцОкончаниеВводаТекста(Текст, Значение, СтандартнаяОбработка);
	
КонецПроцедуры // ПериодВозникновенияОкончаниеВводаТекста()

Процедура СпособВыплатыПриИзменении(Элемент)
	
	Если СпособВыплаты = Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу Тогда
		ЭлементыФормы.НадписьБанк.Видимость = Ложь;
		ЭлементыФормы.Банк.Видимость = Ложь;
	Иначе
		ЭлементыФормы.НадписьБанк.Видимость = Истина;
		ЭлементыФормы.Банк.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОсновнойВидРасчетаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
			БазовыйПериодНачало = ДобавитьМесяц(НачалоМесяца(ДатаНачала),-ВидРасчета.ЧислоМесяцев);
			БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(НачалоМесяца(ДатаНачала),-Мин(ВидРасчета.ЧислоМесяцев, 1)));
	КонецЕсли;
	
КонецПроцедуры

Процедура ДатаНачалаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ДатаНачала)Тогда 
		Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
			ДатаОкончания = КонецМесяца(ДатаНачала);
		Иначе
			ДатаОкончания = Мин(ДатаОкончания,КонецМесяца(ДатаНачала));
		КонецЕсли;
		БазовыйПериодНачало = ДобавитьМесяц(НачалоМесяца(ДатаНачала),-ВидРасчета.ЧислоМесяцев);
		БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(НачалоМесяца(ДатаНачала),-Мин(ВидРасчета.ЧислоМесяцев, 1)));
	КонецЕсли;
КонецПроцедуры

Процедура ПереключательХарактерВыплатыПриИзменении(Элемент)
	
	Если ЭлементыФормы.ПереключательХарактерВыплаты.Значение = 1  Тогда
		ЭлементыФормы.РазмерВыплаты.Доступность = Ложь;
	Иначе
		ЭлементыФормы.РазмерВыплаты.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВидСтажаНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ФормаВыбора = Справочники.ВидыСтажа.ПолучитьФормуВыбора(,ЭлементыФормы.ВидСтажа);

	ФормаВыбора.Отбор.ЛьготныйСтаж.ВидСравнения		= ВидСравнения.Равно;
	ФормаВыбора.Отбор.ЛьготныйСтаж.Значение			= Истина;
	ФормаВыбора.Отбор.ЛьготныйСтаж.Использование	= Истина;

	ФормаВыбора.Открыть();
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ВидСтажаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
		СтандартнаяОбработка = Ложь;
		Элемент.Значение = ВыбранноеЗначение;
	КонецЕсли;

КонецПроцедуры

Процедура ВключатьРаботающихПоДоговорамГПХПриИзменении(Элемент) 
	ЗаполнитьНачальныеНастройки(ЛОЖЬ);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мНастройкаПериода = Новый НастройкаПериода;

мСтруктураНедоступныхОтборов = Новый Структура;
мСписокДоступныхСпособовРасчета = Новый СписокЗначений;

// Устанавливаем соответствие доходов и положенных по ним вычетов для целей исчисления НДФЛ
мСоответствиеДоходовИВычетов = Новый Соответствие;

мОбработкаТайпинга                 = Ложь;
мТекстТайпинга                     = "";
мПоследнееЗначениеЭлементаТайпинга = Неопределено;
